#Область Компонента  

Асинх Функция ПодключитьКомпоненту()
    Подключено = Ждать ПодключитьВнешнююКомпонентуАсинх("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
    
    Если Подключено Тогда
    Иначе
        Ждать УстановитьВнешнююКомпонентуАсинх("ОбщийМакет.PinkRabbitMQ");
        Подключено = Ждать ПодключитьВнешнююКомпонентуАсинх("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
        Если Подключено Тогда
        Иначе
            ПоказатьПредупреждение(, "Не удалось подключить внешнюю компоненту");
        КонецЕсли;
	КонецЕсли; 
	
	Возврат Подключено;
КонецФункции

Асинх Функция ПолучитьКомпоненту() Экспорт
	Если Ждать ПодключитьКомпоненту() Тогда
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ3");
		
		Возврат Компонента;
	КонецЕсли;
КонецФункции

#КонецОбласти 
